mu-dsp-cource/osc_i/conspect.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-04 Sun 13:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Conspect</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Conspect</h1>
<p>
In the beginnig I simply used <code>my_sine</code> function
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #fabd2f;">float</span> <span style="color: #b8bb26;">my_sine</span><span style="color: #fe8019;">(</span><span style="color: #fabd2f;">jack_nframes_t</span> <span style="color: #83a598;">t</span>, <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">f</span><span style="color: #fe8019;">){</span>
    <span style="color: #fb4934;">return</span> vol*sin<span style="color: #cc241d;">(</span><span style="color: #d3869b; font-weight: bold;">2</span>*<span style="color: #d3869b;">PI_F</span>*f*t/sr<span style="color: #cc241d;">)</span>;
<span style="color: #fe8019;">}</span>
</pre>
</div>

<p>
<code>vol</code> - volume <i>(global)</i>
<code>sr</code> - sample rate <i>(global)</i>
<code>f</code> - frequency
<code>t</code> - time
</p>

<p>
There&rsquo;s a problem with changing frequency
</p>

<p>
Looking at <code>sin</code> argument it&rsquo;s easy to see what with fixed <code>f</code> and <code>t</code> changing argument will change from 2 to 2π after  \(\frac{sr}{f}\) times. But when \(f\) changes time to traverse this part is not constant.
</p>

<p>
It&rsquo;s easy to dont think about this &ldquo;simple&rdquo; as it seems formula  of sine argument (or sine phase) \(\phi = ft\) but think about it as <i>function of time and it&rsquo;s derivative</i>.
</p>

<p>
\(\omega = \frac{d\phi}{dt}\)
</p>

<p>
Now we can think about phase \(\phi\) as <i>function of frequency and it&rsquo;s derivative</i> \(\phi = \phi(t, \omega)\) and not \(\phi = \phi(t, f)\)
</p>

<p>
We can use now \(\phi\) for any oscillator (not only sine wave)
Sine function will look like \(osc(\phi) = sine(2\pi\phi)\)
That is \(\phi\) changing from <b><b>0</b></b> to <b><b>1</b></b>
</p>

<p>
Earlier we had changed the frequency directly inside the sine function. Now, to avoid clipping we will change the speed of a phase. The phase function eventually is a $f$-periodic function, which raps from 0 to 1 after \(f\) periods.
</p>

<p>
As we are working with samples, we can think about <code>i</code> and <code>i + 1</code> sample as about instantaneous moment. #+begin<sub>center</sub>
For example if phase in stage <code>i</code> is <i>1</i>-periodic phasor and each step is increased by \(\frac{1}{sr}\) then to make it <i>f</i>-periodic we will increase the rest of the steps by \(\frac{f}{sr}\)
</p>

<p>
The phasor code will be:
</p>
<div class="org-src-container">
<pre class="src src-c">
<span style="color: #fb4934;">static</span> <span style="color: #fabd2f;">float</span> <span style="color: #83a598;">phase</span> = <span style="color: #d3869b; font-weight: bold;">0</span>;

<span style="color: #fb4934;">for</span> <span style="color: #fe8019;">(</span>i = <span style="color: #d3869b; font-weight: bold;">0</span>; i &lt; nframes, i++<span style="color: #fe8019;">){</span>
    phasor_samples_out<span style="color: #cc241d;">[</span>i<span style="color: #cc241d;">]</span> = phase;
    phase += frequency/sample_rate;

    <span style="color: #928374;">// </span><span style="color: #928374;">Bringin back to period [0, 1]</span>
    <span style="color: #fb4934;">while</span><span style="color: #cc241d;">(</span>phase &gt;= <span style="color: #d3869b; font-weight: bold;">1</span><span style="color: #cc241d;">)</span> phase--;
    <span style="color: #fb4934;">while</span><span style="color: #cc241d;">(</span>phase &lt; <span style="color: #d3869b; font-weight: bold;">0</span><span style="color: #cc241d;">)</span> phase++;

<span style="color: #fe8019;">}</span>

</pre>
</div>

<p>
Compared to initial sine
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #fb4934;">for</span> <span style="color: #fe8019;">(</span>i = <span style="color: #d3869b; font-weight: bold;">0</span>; i &lt; nframes; ++i<span style="color: #fe8019;">)</span>
    <span style="color: #fabd2f;">sine_out</span><span style="color: #fe8019;">[</span>i<span style="color: #fe8019;">]</span> = my_sine<span style="color: #fe8019;">(</span>tick++, freq<span style="color: #fe8019;">)</span>;
</pre>
</div>

<p>
We got:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #fb4934;">for</span> <span style="color: #fe8019;">(</span>i = <span style="color: #d3869b; font-weight: bold;">0</span>; i &lt; nframes; ++i<span style="color: #fe8019;">)</span>
    <span style="color: #fabd2f;">sine_out</span><span style="color: #fe8019;">[</span>i<span style="color: #fe8019;">]</span> = my_sine_<span style="color: #fe8019;">(</span>phasor_samples_in<span style="color: #cc241d;">[</span>i<span style="color: #cc241d;">]</span><span style="color: #fe8019;">)</span>;
</pre>
</div>

<p>
That is there&rsquo;is an ability to change instantenious frequency by changing the speed of phasor increasing from 0 to 1 and that ability is seen in the code where  we&rsquo;re putting value also depended on <code>nframes</code> and <code>i</code> (<code>phasor_samples_in</code>)
</p>



<p>
#+end<sub>center</sub>
</p>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-08-04 Sun 13:46</p>
</div>
</body>
</html>
